# 1. *Операції з множинами:*
# Створіть два множини та виконайте на них операції об'єднання, перетину, різниці та симетричної різниці. Виведіть результати кожної операції.
set1 = {1, 2, 3, 4, 5}
set2 = {4, 5, 6, 7, 8}

union_set = set1 | set2
intersection_set = set1 & set2
difference_set = set1 - set2
symmetric_difference_set = set1 ^ set2

print("Об'єднання множин:", union_set)
print("Перетин множин:", intersection_set)
print("Різниця множин:", difference_set)
print("Симетрична різниця множин:", symmetric_difference_set)

#2. *Перевірка належності:*
# Створіть множину з декількох елементів. Напишіть програму, яка запитує у користувача значення та перевіряє, 
# чи належить введене значення до цієї множини. Виведіть відповідне повідомлення.
my_set = {1, 2, 3, 4, 5}
value = int(input("Введіть значення: "))

if value in my_set:
    print("Значення належить множині.")
else:
    print("Значення не належить множині.")

#3. *Порівняння множин:*
# Створіть дві множини різного розміру. Напишіть програму, яка перевіряє, чи є одна множина підмножиною іншої. Виведіть результат порівняння.
set1 = {1, 2, 3}
set2 = {1, 2, 3, 4, 5}

if set1.issubset(set2):
    print("Перша множина є підмножиною другої.")
else:
    print("Перша множина не є підмножиною другої.")