# Завдання 1 Створіть кортеж, що містить назви місяців у річному циклі та виведіть його.
months = ('Січень', 'Лютий', 'Березень', 'Квітень', 'Травень', 'Червень', 'Липень', 'Серпень', 'Вересень', 'Жовтень', 'Листопад', 'Грудень')
print(months)

# Завдання 2 Створіть два кортежі, об'єднайте їх та виведіть результат.
tuple1 = ('a', 'b', 'c')
tuple2 = (1, 2, 3)
combined_tuple = tuple1 + tuple2
print(combined_tuple)

# Завдання 3 3. Створіть кортеж, що містить дані про книгу (наприклад, назва, автор, рік видання) та виведіть його.
book_info = ('Пригоди Гаррі Поттера', 'Джоан Роулінг', 1997)
print(book_info)